Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.ThermalResistance
The thermal resistance (R-value) of the material, in m^2*K/W (eqivelent to K*s^3/kg).
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.SpecificHeatCapacity
The specific heat capacity of the material, in ft^2/(k*s^2).
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.Density
The density of the material, in kg/(ft^3).
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.ThermalConductivity
The thermal conductivity of the material, kg*ft/(k*s^3).
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial.Thickness
The thickness of the material, in ft.
Since:
2024